{
  "_name_or_path": "facebook/detr-resnet-50",
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "DetrForObjectDetection"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone": "resnet50",
  "backbone_config": null,
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "classifier_dropout": 0.0,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "dice_loss_coefficient": 1,
  "dilation": false,
  "dropout": 0.1,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "id2label": {
    "0": "Ingredients",
    "1": "apple",
    "2": "asparagus",
    "3": "avocado",
    "4": "banana",
    "5": "bean",
    "6": "beef",
    "7": "blueberry",
    "8": "bread",
    "9": "broccoli",
    "10": "butter",
    "11": "cabbage",
    "12": "carrot",
    "13": "cauliflower",
    "14": "cheese",
    "15": "chicken",
    "16": "chicken breast",
    "17": "chilli",
    "18": "chocolate",
    "19": "corn",
    "20": "cucumber",
    "21": "egg",
    "22": "eggplant",
    "23": "fish",
    "24": "flour",
    "25": "garlic",
    "26": "ginger",
    "27": "grape",
    "28": "ham",
    "29": "kiwi",
    "30": "leek",
    "31": "lemon",
    "32": "lettuce",
    "33": "lime",
    "34": "mango",
    "35": "milk",
    "36": "mushroom",
    "37": "onion",
    "38": "orange",
    "39": "pea",
    "40": "peach",
    "41": "pear",
    "42": "pepper",
    "43": "pineapple",
    "44": "potato",
    "45": "radish",
    "46": "sausage",
    "47": "spinach",
    "48": "strawberry",
    "49": "sweet potato",
    "50": "tomato",
    "51": "watermelon",
    "52": "yogurt",
    "53": "zucchini"
  },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "label2id": {
    "Ingredients": 0,
    "apple": 1,
    "asparagus": 2,
    "avocado": 3,
    "banana": 4,
    "bean": 5,
    "beef": 6,
    "blueberry": 7,
    "bread": 8,
    "broccoli": 9,
    "butter": 10,
    "cabbage": 11,
    "carrot": 12,
    "cauliflower": 13,
    "cheese": 14,
    "chicken": 15,
    "chicken breast": 16,
    "chilli": 17,
    "chocolate": 18,
    "corn": 19,
    "cucumber": 20,
    "egg": 21,
    "eggplant": 22,
    "fish": 23,
    "flour": 24,
    "garlic": 25,
    "ginger": 26,
    "grape": 27,
    "ham": 28,
    "kiwi": 29,
    "leek": 30,
    "lemon": 31,
    "lettuce": 32,
    "lime": 33,
    "mango": 34,
    "milk": 35,
    "mushroom": 36,
    "onion": 37,
    "orange": 38,
    "pea": 39,
    "peach": 40,
    "pear": 41,
    "pepper": 42,
    "pineapple": 43,
    "potato": 44,
    "radish": 45,
    "sausage": 46,
    "spinach": 47,
    "strawberry": 48,
    "sweet potato": 49,
    "tomato": 50,
    "watermelon": 51,
    "yogurt": 52,
    "zucchini": 53
  },
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 1024,
  "model_type": "detr",
  "num_channels": 3,
  "num_hidden_layers": 6,
  "num_queries": 100,
  "position_embedding_type": "sine",
  "scale_embedding": false,
  "torch_dtype": "float32",
  "transformers_version": "4.35.2",
  "use_pretrained_backbone": true,
  "use_timm_backbone": true
}
